/**
 * 更新日期： 2024-11-01T15:31:33+08:00
 * 用法：Sub-Store 脚本操作添加
 * rename.js 以下是此脚本支持的参数，必须以 # 为开头多个参数使用"&"连接，参考上述地址为例使用参数。 禁用缓存url#noCache
 *
 *** 主要参数
 * [in=] 自动判断机场节点名类型 优先级 zh(中文) -> flag(国旗) -> quan(英文全称) -> en(英文简写)
 * 如果不准的情况, 可以加参数指定:
 *
 * [nm]    保留没有匹配到的节点
 * [in=zh] 或in=cn识别中文
 * [in=en] 或in=us 识别英文缩写
 * [in=flag] 或in=gq 识别国旗 如果加参数 in=flag 则识别国旗 脚本操作前面不要添加国旗操作 否则移除国旗后面脚本识别不到
 * [in=quan] 识别英文全称

 *
 * [out=]   输出节点名可选参数: (cn或zh ，us或en ，gq或flag ，quan) 对应：(中文，英文缩写 ，国旗 ，英文全称) 默认中文 例如 [out=en] 或 out=us 输出英文缩写
 *** 分隔符参数
 *
 * [fgf=]   节点名前缀或国旗分隔符，默认为空格；
 * [sn=]    设置国家与序号之间的分隔符，默认为空格；
 * 序号参数
 * [one]    清理只有一个节点的地区的01
 * [flag]   给节点前面加国旗
 *
 *** 前缀参数
 * [flowername]  节点是否添加机场花体名称前缀，默认值为订阅名称；
 * [name=]  可选，节点添加机场名称前缀；
 * [nf]     把 name= 的前缀值放在最前面
 * [font=]  添加名称前缀的字体类型
 * [style=] 添加名称前缀的字体样式类型
 *** 保留参数
 * [blkey=iplc+gpt+NF+IPLC] 用+号添加多个关键词 保留节点名的自定义字段 需要区分大小写!
 * 如果需要修改 保留的关键词 替换成别的 可以用 > 分割 例如 [#blkey=GPT>新名字+其他关键词] 这将把【GPT】替换成【新名字】
 * 例如      https://raw.githubusercontent.com/Keywos/rule/main/rename.js#flag&blkey=GPT>新名字+NF
 * [blgd]   保留: 家宽 IPLC ˣ² 等
 * [bl]     正则匹配保留 [0.1x, x0.2, 6x ,3倍]等标识
 * [nx]     保留1倍率与不显示倍率的
 * [blnx]   只保留高倍率
 * [clear]  清理乱名
 * [blpx]   如果用了上面的bl参数,对保留标识后的名称分组排序,如果没用上面的bl参数单独使用blpx则不起任何作用
 * [blockquic] blockquic=on 阻止; blockquic=off 不阻止
 */

// const inArg = {'blkey':'iplc+GPT>GPTnewName+NF+IPLC', 'flag':true };
const inArg = $arguments; // console.log(inArg)
const nx = inArg.nx || false,
    bl = inArg.bl || false,
    nf = inArg.nf || false,
    key = inArg.key || false,
    blgd = inArg.blgd || false,
    blpx = inArg.blpx || false,
    blnx = inArg.blnx || false,
    numone = inArg.one || false,
    debug = inArg.debug || false,
    clear = inArg.clear || false,
    addflag = inArg.flag || false,
    nm = inArg.nm || false,
    flowerName = inArg.flowername || false,
    font = inArg.font || "serif",
    style = inArg.style || "bold-italic";

const FGF = inArg.fgf == undefined ? " " : decodeURI(inArg.fgf),
    XHFGF = inArg.sn == undefined ? " " : decodeURI(inArg.sn),
    BLKEY = inArg.blkey == undefined ? "" : decodeURI(inArg.blkey),
    blockquic = inArg.blockquic == undefined ? "" : decodeURI(inArg.blockquic),
    nameMap = {
        cn: "cn",
        zh: "cn",
        us: "us",
        en: "us",
        quan: "quan",
        gq: "gq",
        flag: "gq",
    },
    inname = nameMap[inArg.in] || "",
    outputName = nameMap[inArg.out] || "";
// prettier-ignore
const FG = ['🇭🇰', '🇲🇴', '🇹🇼', '🇯🇵', '🇰🇷', '🇸🇬', '🇺🇸', '🇬🇧', '🇫🇷', '🇩🇪', '🇦🇺', '🇦🇪', '🇦🇫', '🇦🇱', '🇩🇿', '🇦🇴', '🇦🇷', '🇦🇲', '🇦🇹', '🇦🇿', '🇧🇭', '🇧🇩', '🇧🇾', '🇧🇪', '🇧🇿', '🇧🇯', '🇧🇹', '🇧🇴', '🇧🇦', '🇧🇼', '🇧🇷', '🇻🇬', '🇧🇳', '🇧🇬', '🇧🇫', '🇧🇮', '🇰🇭', '🇨🇲', '🇨🇦', '🇨🇻', '🇰🇾', '🇨🇫', '🇹🇩', '🇨🇱', '🇨🇴', '🇰🇲', '🇨🇬', '🇨🇩', '🇨🇷', '🇭🇷', '🇨🇾', '🇨🇿', '🇩🇰', '🇩🇯', '🇩🇴', '🇪🇨', '🇪🇬', '🇸🇻', '🇬🇶', '🇪🇷', '🇪🇪', '🇪🇹', '🇫🇯', '🇫🇮', '🇬🇦', '🇬🇲', '🇬🇪', '🇬🇭', '🇬🇷', '🇬🇱', '🇬🇹', '🇬🇳', '🇬🇾', '🇭🇹', '🇭🇳', '🇭🇺', '🇮🇸', '🇮🇳', '🇮🇩', '🇮🇷', '🇮🇶', '🇮🇪', '🇮🇲', '🇮🇱', '🇮🇹', '🇨🇮', '🇯🇲', '🇯🇴', '🇰🇿', '🇰🇪', '🇰🇼', '🇰🇬', '🇱🇦', '🇱🇻', '🇱🇧', '🇱🇸', '🇱🇷', '🇱🇾', '🇱🇹', '🇱🇺', '🇲🇰', '🇲🇬', '🇲🇼', '🇲🇾', '🇲🇻', '🇲🇱', '🇲🇹', '🇲🇷', '🇲🇺', '🇲🇽', '🇲🇩', '🇲🇨', '🇲🇳', '🇲🇪', '🇲🇦', '🇲🇿', '🇲🇲', '🇳🇦', '🇳🇵', '🇳🇱', '🇳🇿', '🇳🇮', '🇳🇪', '🇳🇬', '🇰🇵', '🇳🇴', '🇴🇲', '🇵🇰', '🇵🇦', '🇵🇾', '🇵🇪', '🇵🇭', '🇵🇹', '🇵🇷', '🇶🇦', '🇷🇴', '🇷🇺', '🇷🇼', '🇸🇲', '🇸🇦', '🇸🇳', '🇷🇸', '🇸🇱', '🇸🇰', '🇸🇮', '🇸🇴', '🇿🇦', '🇪🇸', '🇱🇰', '🇸🇩', '🇸🇷', '🇸🇿', '🇸🇪', '🇨🇭', '🇸🇾', '🇹🇯', '🇹🇿', '🇹🇭', '🇹🇬', '🇹🇴', '🇹🇹', '🇹🇳', '🇹🇷', '🇹🇲', '🇻🇮', '🇺🇬', '🇺🇦', '🇺🇾', '🇺🇿', '🇻🇪', '🇻🇳', '🇾🇪', '🇿🇲', '🇿🇼', '🇦🇩', '🇷🇪', '🇵🇱', '🇬🇺', '🇻🇦', '🇱🇮', '🇨🇼', '🇸🇨', '🇦🇶', '🇬🇮', '🇨🇺', '🇫🇴', '🇦🇽', '🇧🇲', '🇹🇱']
// prettier-ignore
const EN = ['HK', 'MO', 'TW', 'JP', 'KR', 'SG', 'US', 'GB', 'FR', 'DE', 'AU', 'AE', 'AF', 'AL', 'DZ', 'AO', 'AR', 'AM', 'AT', 'AZ', 'BH', 'BD', 'BY', 'BE', 'BZ', 'BJ', 'BT', 'BO', 'BA', 'BW', 'BR', 'VG', 'BN', 'BG', 'BF', 'BI', 'KH', 'CM', 'CA', 'CV', 'KY', 'CF', 'TD', 'CL', 'CO', 'KM', 'CG', 'CD', 'CR', 'HR', 'CY', 'CZ', 'DK', 'DJ', 'DO', 'EC', 'EG', 'SV', 'GQ', 'ER', 'EE', 'ET', 'FJ', 'FI', 'GA', 'GM', 'GE', 'GH', 'GR', 'GL', 'GT', 'GN', 'GY', 'HT', 'HN', 'HU', 'IS', 'IN', 'ID', 'IR', 'IQ', 'IE', 'IM', 'IL', 'IT', 'CI', 'JM', 'JO', 'KZ', 'KE', 'KW', 'KG', 'LA', 'LV', 'LB', 'LS', 'LR', 'LY', 'LT', 'LU', 'MK', 'MG', 'MW', 'MY', 'MV', 'ML', 'MT', 'MR', 'MU', 'MX', 'MD', 'MC', 'MN', 'ME', 'MA', 'MZ', 'MM', 'NA', 'NP', 'NL', 'NZ', 'NI', 'NE', 'NG', 'KP', 'NO', 'OM', 'PK', 'PA', 'PY', 'PE', 'PH', 'PT', 'PR', 'QA', 'RO', 'RU', 'RW', 'SM', 'SA', 'SN', 'RS', 'SL', 'SK', 'SI', 'SO', 'ZA', 'ES', 'LK', 'SD', 'SR', 'SZ', 'SE', 'CH', 'SY', 'TJ', 'TZ', 'TH', 'TG', 'TO', 'TT', 'TN', 'TR', 'TM', 'VI', 'UG', 'UA', 'UY', 'UZ', 'VE', 'VN', 'YE', 'ZM', 'ZW', 'AD', 'RE', 'PL', 'GU', 'VA', 'LI', 'CW', 'SC', 'AQ', 'GI', 'CU', 'FO', 'AX', 'BM', 'TL'];
// prettier-ignore
const ZH = ['香港', '澳门', '台湾', '日本', '韩国', '新加坡', '美国', '英国', '法国', '德国', '澳大利亚', '阿联酋', '阿富汗', '阿尔巴尼亚', '阿尔及利亚', '安哥拉', '阿根廷', '亚美尼亚', '奥地利', '阿塞拜疆', '巴林', '孟加拉国', '白俄罗斯', '比利时', '伯利兹', '贝宁', '不丹', '玻利维亚', '波斯尼亚和黑塞哥维那', '博茨瓦纳', '巴西', '英属维京群岛', '文莱', '保加利亚', '布基纳法索', '布隆迪', '柬埔寨', '喀麦隆', '加拿大', '佛得角', '开曼群岛', '中非共和国', '乍得', '智利', '哥伦比亚', '科摩罗', '刚果(布)', '刚果(金)', '哥斯达黎加', '克罗地亚', '塞浦路斯', '捷克', '丹麦', '吉布提', '多米尼加共和国', '厄瓜多尔', '埃及', '萨尔瓦多', '赤道几内亚', '厄立特里亚', '爱沙尼亚', '埃塞俄比亚', '斐济', '芬兰', '加蓬', '冈比亚', '格鲁吉亚', '加纳', '希腊', '格陵兰', '危地马拉', '几内亚', '圭亚那', '海地', '洪都拉斯', '匈牙利', '冰岛', '印度', '印尼', '伊朗', '伊拉克', '爱尔兰', '马恩岛', '以色列', '意大利', '科特迪瓦', '牙买加', '约旦', '哈萨克斯坦', '肯尼亚', '科威特', '吉尔吉斯斯坦', '老挝', '拉脱维亚', '黎巴嫩', '莱索托', '利比里亚', '利比亚', '立陶宛', '卢森堡', '马其顿', '马达加斯加', '马拉维', '马来', '马尔代夫', '马里', '马耳他', '毛利塔尼亚', '毛里求斯', '墨西哥', '摩尔多瓦', '摩纳哥', '蒙古', '黑山共和国', '摩洛哥', '莫桑比克', '缅甸', '纳米比亚', '尼泊尔', '荷兰', '新西兰', '尼加拉瓜', '尼日尔', '尼日利亚', '朝鲜', '挪威', '阿曼', '巴基斯坦', '巴拿马', '巴拉圭', '秘鲁', '菲律宾', '葡萄牙', '波多黎各', '卡塔尔', '罗马尼亚', '俄罗斯', '卢旺达', '圣马力诺', '沙特阿拉伯', '塞内加尔', '塞尔维亚', '塞拉利昂', '斯洛伐克', '斯洛文尼亚', '索马里', '南非', '西班牙', '斯里兰卡', '苏丹', '苏里南', '斯威士兰', '瑞典', '瑞士', '叙利亚', '塔吉克斯坦', '坦桑尼亚', '泰国', '多哥', '汤加', '特立尼达和多巴哥', '突尼斯', '土耳其', '土库曼斯坦', '美属维尔京群岛', '乌干达', '乌克兰', '乌拉圭', '乌兹别克斯坦', '委内瑞拉', '越南', '也门', '赞比亚', '津巴布韦', '安道尔', '留尼汪', '波兰', '关岛', '梵蒂冈', '列支敦士登', '库拉索', '塞舌尔', '南极', '直布罗陀', '古巴', '法罗群岛', '奥兰群岛', '百慕达', '东帝汶'];
// prettier-ignore
const QC = ['Hong Kong', 'Macao', 'Taiwan', 'Japan', 'Korea', 'Singapore', 'United States', 'United Kingdom', 'France', 'Germany', 'Australia', 'Dubai', 'Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina', 'Armenia', 'Austria', 'Azerbaijan', 'Bahrain', 'Bangladesh', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil', 'British Virgin Islands', 'Brunei', 'Bulgaria', 'Burkina-faso', 'Burundi', 'Cambodia', 'Cameroon', 'Canada', 'CapeVerde', 'CaymanIslands', 'Central African Republic', 'Chad', 'Chile', 'Colombia', 'Comoros', 'Congo-Brazzaville', 'Congo-Kinshasa', 'CostaRica', 'Croatia', 'Cyprus', 'Czech Republic', 'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt', 'EISalvador', 'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia', 'Fiji', 'Finland', 'Gabon', 'Gambia', 'Georgia', 'Ghana', 'Greece', 'Greenland', 'Guatemala', 'Guinea', 'Guyana', 'Haiti', 'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Isle of Man', 'Israel', 'Italy', 'Ivory Coast', 'Jamaica', 'Jordan', 'Kazakstan', 'Kenya', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania', 'Luxembourg', 'Macedonia', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives', 'Mali', 'Malta', 'Mauritania', 'Mauritius', 'Mexico', 'Moldova', 'Monaco', 'Mongolia', 'Montenegro', 'Morocco', 'Mozambique', 'Myanmar(Burma)', 'Namibia', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'NorthKorea', 'Norway', 'Oman', 'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Portugal', 'PuertoRico', 'Qatar', 'Romania', 'Russia', 'Rwanda', 'SanMarino', 'SaudiArabia', 'Senegal', 'Serbia', 'SierraLeone', 'Slovakia', 'Slovenia', 'Somalia', 'SouthAfrica', 'Spain', 'SriLanka', 'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Tajikstan', 'Tanzania', 'Thailand', 'Togo', 'Tonga', 'TrinidadandTobago', 'Tunisia', 'Turkey', 'Turkmenistan', 'U.S.Virgin Islands', 'Uganda', 'Ukraine', 'Uruguay', 'Uzbekistan', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe', 'Andorra', 'Reunion', 'Poland', 'Guam', 'Vatican', 'Liechtensteins', 'Curacao', 'Seychelles', 'Antarctica', 'Gibraltar', 'Cuba', 'Faroe Islands', 'Ahvenanmaa', 'Bermuda', 'Timor-Leste'];
const specialRegex = [
    /(\d\.)?\d+×/,
    /IPLC|IEPL|Kern|Edge|Pro|Std|Exp|Biz|Fam|Game|Buy|Zx|LB|Game/,
];
const nameclear =
    /(套餐|到期|有效|剩余|版本|已用|过期|失联|测试|官方|网址|备用|群|TEST|客服|网站|获取|订阅|流量|机场|下次|官址|联系|邮箱|工单|学术|USE|USED|TOTAL|EXPIRE|EMAIL)/i;
// prettier-ignore
const regexArray = [/ˣ²/, /ˣ³/, /ˣ⁴/, /ˣ⁵/, /ˣ⁶/, /ˣ⁷/, /ˣ⁸/, /ˣ⁹/, /ˣ¹⁰/, /ˣ²⁰/, /ˣ³⁰/, /ˣ⁴⁰/, /ˣ⁵⁰/, /IPLC/i, /IEPL/i, /核心/, /边缘/, /高级/, /标准/, /实验/, /商宽/, /家宽/, /游戏|game/i, /购物/, /专线/, /LB/, /cloudflare/i, /\budp\b/i, /\bgpt\b/i, /udpn\b/];
// prettier-ignore
const valueArray = ["2×", "3×", "4×", "5×", "6×", "7×", "8×", "9×", "10×", "20×", "30×", "40×", "50×", "IPLC", "IEPL", "Kern", "Edge", "Pro", "Std", "Exp", "Biz", "Fam", "Game", "Buy", "Zx", "LB", "CF", "UDP", "GPT", "UDPN"];
const nameblnx = /(高倍|(?!1)2+(x|倍)|ˣ²|ˣ³|ˣ⁴|ˣ⁵|ˣ¹⁰)/i;
const namenx = /(高倍|(?!1)(0\.|\d)+(x|倍)|ˣ²|ˣ³|ˣ⁴|ˣ⁵|ˣ¹⁰)/i;
const keya =
    /港|Hong|HK|新加坡|SG|Singapore|日本|Japan|JP|美国|United States|US|韩|土耳其|TR|Turkey|Korea|KR|🇸🇬|🇭🇰|🇯🇵|🇺🇸|🇰🇷|🇹🇷/i;
const keyb =
    /(((1|2|3|4)\d)|(香港|Hong|HK) 0[5-9]|((新加坡|SG|Singapore|日本|Japan|JP|美国|United States|US|韩|土耳其|TR|Turkey|Korea|KR) 0[3-9]))/i;
const rurekey = {
    GB: /UK/g,
    "B-G-P": /BGP/g,
    "Russia Moscow": /Moscow/g,
    "Korea Chuncheon": /Chuncheon|Seoul/g,
    "Hong Kong": /Hongkong|HONG KONG/gi,
    "United Kingdom London": /London|Great Britain/g,
    "Dubai United Arab Emirates": /United Arab Emirates/g,
    "Taiwan TW 台湾 🇹🇼": /(台|Tai\s?wan|TW).*?🇨🇳|🇨🇳.*?(台|Tai\s?wan|TW)/g,
    "United States": /USA|Los Angeles|San Jose|Silicon Valley|Michigan/g,
    澳大利亚: /澳洲|墨尔本|悉尼|土澳|(深|沪|呼|京|广|杭)澳/g,
    德国: /(深|沪|呼|京|广|杭)德(?!.*(I|线))|法兰克福|滬德/g,
    香港: /(深|沪|呼|京|广|杭)港(?!.*(I|线))/g,
    日本: /(深|沪|呼|京|广|杭|中|辽)日(?!.*(I|线))|东京|大坂/g,
    新加坡: /狮城|(深|沪|呼|京|广|杭)新/g,
    美国: /(深|沪|呼|京|广|杭)美|波特兰|芝加哥|哥伦布|纽约|硅谷|俄勒冈|西雅图|芝加哥/g,
    波斯尼亚和黑塞哥维那: /波黑共和国/g,
    印尼: /印度尼西亚|雅加达/g,
    印度: /孟买/g,
    阿联酋: /迪拜|阿拉伯联合酋长国/g,
    孟加拉国: /孟加拉/g,
    捷克: /捷克共和国/g,
    台湾: /新台|新北|台(?!.*线)/g,
    Taiwan: /Taipei/g,
    韩国: /春川|韩|首尔/g,
    Japan: /Tokyo|Osaka/g,
    英国: /伦敦/g,
    India: /Mumbai/g,
    Germany: /Frankfurt/g,
    Switzerland: /Zurich/g,
    俄罗斯: /莫斯科/g,
    土耳其: /伊斯坦布尔/g,
    泰国: /泰國|曼谷/g,
    法国: /巴黎/g,
    G: /\d\s?GB/gi,
    Esnc: /esnc/gi,
};

const FONT_DATA = {
    serif: {
        regular: ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        bold: ["𝐀", "𝐁", "𝐂", "𝐃", "𝐄", "𝐅", "𝐆", "𝐇", "𝐈", "𝐉", "𝐊", "𝐋", "𝐌", "𝐍", "𝐎", "𝐏", "𝐐", "𝐑", "𝐒", "𝐓", "𝐔", "𝐕", "𝐖", "𝐗", "𝐘", "𝐙", "𝐚", "𝐛", "𝐜", "𝐝", "𝐞", "𝐟", "𝐠", "𝐡", "𝐢", "𝐣", "𝐤", "𝐥", "𝐦", "𝐧", "𝐨", "𝐩", "𝐪", "𝐫", "𝐬", "𝐭", "𝐮", "𝐯", "𝐰", "𝐱", "𝐲", "𝐳", "𝟎", "𝟏", "𝟐", "𝟑", "𝟒", "𝟓", "𝟔", "𝟕", "𝟖", "𝟗"],
        italic: ["𝐴", "𝐵", "𝐶", "𝐷", "𝐸", "𝐹", "𝐺", "𝐻", "𝐼", "𝐽", "𝐾", "𝐿", "𝑀", "𝑁", "𝑂", "𝑃", "𝑄", "𝑅", "𝑆", "𝑇", "𝑈", "𝑉", "𝑊", "𝑋", "𝑌", "𝑍", "𝑎", "𝑏", "𝑐", "𝑑", "𝑒", "𝑓", "𝑔", "ℎ", "𝑖", "𝑗", "𝑘", "𝑙", "𝑚", "𝑛", "𝑜", "𝑝", "𝑞", "𝑟", "𝑠", "𝑡", "𝑢", "𝑣", "𝑤", "𝑥", "𝑦", "𝑧"],
        "bold-italic": ["𝑨", "𝑩", "𝑪", "𝑫", "𝑬", "𝑭", "𝑮", "𝑯", "𝑰", "𝑱", "𝑲", "𝑳", "𝑴", "𝑵", "𝑶", "𝑷", "𝑸", "𝑹", "𝑺", "𝑻", "𝑼", "𝑽", "𝑾", "𝑿", "𝒀", "𝒁", "𝒂", "𝒃", "𝒄", "𝒅", "𝒆", "𝒇", "𝒈", "𝒉", "𝒊", "𝒋", "𝒌", "𝒍", "𝒎", "𝒏", "𝒐", "𝒑", "𝒒", "𝒓", "𝒔", "𝒕", "𝒖", "𝒗", "𝒘", "𝒙", "𝒚", "𝒛"]
    },
    "sans-serif": {
        regular: ["𝖠", "𝖡", "𝖢", "𝖣", "𝖤", "𝖥", "𝖦", "𝖧", "𝖨", "𝖩", "𝖪", "𝖫", "𝖬", "𝖭", "𝖮", "𝖯", "𝖰", "𝖱", "𝖲", "𝖳", "𝖴", "𝖵", "𝖶", "𝖷", "𝖸", "𝖹", "𝖺", "𝖻", "𝖼", "𝖽", "𝖾", "𝖿", "𝗀", "𝗁", "𝗂", "𝗃", "𝗄", "𝗅", "𝗆", "𝗇", "𝗈", "𝗉", "𝗊", "𝗋", "𝗌", "𝗍", "𝗎", "𝗏", "𝗐", "𝗑", "𝗒", "𝗓", "𝟢", "𝟣", "𝟤", "𝟥", "𝟦", "𝟧", "𝟨", "𝟩", "𝟪", "𝟫"],
        bold: ["𝗔", "𝗕", "𝗖", "𝗗", "𝗘", "𝗙", "𝗚", "𝗛", "𝗜", "𝗝", "𝗞", "𝗟", "𝗠", "𝗡", "𝗢", "𝗣", "𝗤", "𝗥", "𝗦", "𝗧", "𝗨", "𝗩", "𝗪", "𝗫", "𝗬", "𝗭", "𝗮", "𝗯", "𝗰", "𝗱", "𝗲", "𝗳", "𝗴", "𝗵", "𝗶", "𝗷", "𝗸", "𝗹", "𝗺", "𝗻", "𝗼", "𝗽", "𝗾", "𝗿", "𝘀", "𝘁", "𝘂", "𝘃", "𝘄", "𝘅", "𝘆", "𝘇", "𝟬", "𝟭", "𝟮", "𝟯", "𝟰", "𝟱", "𝟲", "𝟳", "𝟴", "𝟵"],
        italic: ["𝘈", "𝘉", "𝘊", "𝘋", "𝘌", "𝘍", "𝘎", "𝘏", "𝘐", "𝘑", "𝘒", "𝘓", "𝘔", "𝘕", "𝘖", "𝘗", "𝘘", "𝘙", "𝘚", "𝘛", "𝘜", "𝘝", "𝘞", "𝘟", "𝘠", "𝘡", "𝘢", "𝘣", "𝘤", "𝘥", "𝘦", "𝘧", "𝘨", "𝘩", "𝘪", "𝘫", "𝘬", "𝘭", "𝘮", "𝘯", "𝘰", "𝘱", "𝘲", "𝘳", "𝘴", "𝘵", "𝘶", "𝘷", "𝘸", "𝘹", "𝘺", "𝘻"],
        "bold-italic": ["𝘼", "𝘽", "𝘾", "𝘿", "𝙀", "𝙁", "𝙂", "𝙃", "𝙄", "𝙅", "𝙆", "𝙇", "𝙈", "𝙉", "𝙊", "𝙋", "𝙌", "𝙍", "𝙎", "𝙏", "𝙐", "𝙑", "𝙒", "𝙓", "𝙔", "𝙕", "𝙖", "𝙗", "𝙘", "𝙙", "𝙚", "𝙛", "𝙜", "𝙝", "𝙞", "𝙟", "𝙠", "𝙡", "𝙢", "𝙣", "𝙤", "𝙥", "𝙦", "𝙧", "𝙨", "𝙩", "𝙪", "𝙫", "𝙬", "𝙭", "𝙮", "𝙯"]
    },
    script: {
        regular: ["𝒜", "ℬ", "𝒞", "𝒟", "ℰ", "ℱ", "𝒢", "ℋ", "ℐ", "𝒥", "𝒦", "ℒ", "ℳ", "𝒩", "𝒪", "𝒫", "𝒬", "ℛ", "𝒮", "𝒯", "𝒰", "𝒱", "𝒲", "𝒳", "𝒴", "𝒵", "𝒶", "𝒷", "𝒸", "𝒹", "ℯ", "𝒻", "ℊ", "𝒽", "𝒾", "𝒿", "𝓀", "𝓁", "𝓂", "𝓃", "ℴ", "𝓅", "𝓆", "𝓇", "𝓈", "𝓉", "𝓊", "𝓋", "𝓌", "𝓍", "𝓎", "𝓏"],
        bold: ["𝓐", "𝓑", "𝓒", "𝓓", "𝓔", "𝓕", "𝓖", "𝓗", "𝓘", "𝓙", "𝓚", "𝓛", "𝓜", "𝓝", "𝓞", "𝓟", "𝓠", "𝓡", "𝓢", "𝓣", "𝓤", "𝓥", "𝓦", "𝓧", "𝓨", "𝓩", "𝓪", "𝓫", "𝓬", "𝓭", "𝓮", "𝓯", "𝓰", "𝓱", "𝓲", "𝓳", "𝓴", "𝓵", "𝓶", "𝓷", "𝓸", "𝓹", "𝓺", "𝓻", "𝓼", "𝓽", "𝓾", "𝓿", "𝔀", "𝔁", "𝔂", "𝔃"]
    },
    fraktur: {
        regular: ["𝔄", "𝔅", "ℭ", "𝔇", "𝔈", "𝔉", "𝔊", "ℌ", "ℑ", "𝔍", "𝔎", "𝔏", "𝔐", "𝔑", "𝔒", "𝔓", "𝔔", "ℜ", "𝔖", "𝔗", "𝔘", "𝔙", "𝔚", "𝔛", "𝔜", "ℨ", "𝔞", "𝔟", "𝔠", "𝔡", "𝔢", "𝔣", "𝔤", "𝔥", "𝔦", "𝔧", "𝔨", "𝔩", "𝔪", "𝔫", "𝔬", "𝔭", "𝔮", "𝔯", "𝔰", "𝔱", "𝔲", "𝔳", "𝔴", "𝔵", "𝔶", "𝔷"],
        bold: ["𝕬", "𝕭", "𝕮", "𝕯", "𝕰", "𝕱", "𝕲", "𝕳", "𝕴", "𝕵", "𝕶", "𝕷", "𝕸", "𝕹", "𝕺", "𝕻", "𝕼", "𝕽", "𝕾", "𝕿", "𝖀", "𝖁", "𝖂", "𝖃", "𝖄", "𝖅", "𝖆", "𝖇", "𝖈", "𝖉", "𝖊", "𝖋", "𝖌", "𝖍", "𝖎", "𝖏", "𝖐", "𝖑", "𝖒", "𝖓", "𝖔", "𝖕", "𝖖", "𝖗", "𝖘", "𝖙", "𝖚", "𝖛", "𝖜", "𝖝", "𝖞", "𝖟"]
    },
    monospace: {
        regular: ["𝙰", "𝙱", "𝙲", "𝙳", "𝙴", "𝙵", "𝙶", "𝙷", "𝙸", "𝙹", "𝙺", "𝙻", "𝙼", "𝙽", "𝙾", "𝙿", "𝚀", "𝚁", "𝚂", "𝚃", "𝚄", "𝚅", "𝚆", "𝚇", "𝚈", "𝚉", "𝚊", "𝚋", "𝚌", "𝚍", "𝚎", "𝚏", "𝚐", "𝚑", "𝚒", "𝚓", "𝚔", "𝚕", "𝚖", "𝚗", "𝚘", "𝚙", "𝚚", "𝚛", "𝚜", "𝚝", "𝚞", "𝚟", "𝚠", "𝚡", "𝚢", "𝚣", "𝟶", "𝟷", "𝟸", "𝟹", "𝟺", "𝟻", "𝟼", "𝟽", "𝟾", "𝟿"]
    },
    "double-struck": {
        bold: ["𝔸", "𝔹", "ℂ", "𝔻", "𝔼", "𝔽", "𝔾", "ℍ", "𝕀", "𝕁", "𝕂", "𝕃", "𝕄", "ℕ", "𝕆", "ℙ", "ℚ", "ℝ", "𝕊", "𝕋", "𝕌", "𝕍", "𝕎", "𝕏", "𝕐", "ℤ", "𝕒", "𝕓", "𝕔", "𝕕", "𝕖", "𝕗", "𝕘", "𝕙", "𝕚", "𝕛", "𝕜", "𝕝", "𝕞", "𝕟", "𝕠", "𝕡", "𝕢", "𝕣", "𝕤", "𝕥", "𝕦", "𝕧", "𝕨", "𝕩", "𝕪", "𝕫", "𝟘", "𝟙", "𝟚", "𝟛", "𝟜", "𝟝", "𝟞", "𝟟", "𝟠", "𝟡"]
    },
    circle: {
        regular: ["Ⓐ", "Ⓑ", "Ⓒ", "Ⓓ", "Ⓔ", "Ⓕ", "Ⓖ", "Ⓗ", "Ⓘ", "Ⓙ", "Ⓚ", "Ⓛ", "Ⓜ", "Ⓝ", "Ⓞ", "Ⓟ", "Ⓠ", "Ⓡ", "Ⓢ", "Ⓣ", "Ⓤ", "Ⓥ", "Ⓦ", "Ⓧ", "Ⓨ", "Ⓩ", "ⓐ", "ⓑ", "ⓒ", "ⓓ", "ⓔ", "ⓕ", "ⓖ", "ⓗ", "ⓘ", "ⓙ", "ⓚ", "ⓛ", "ⓜ", "ⓝ", "ⓞ", "ⓟ", "ⓠ", "ⓡ", "ⓢ", "ⓣ", "ⓤ", "ⓥ", "ⓦ", "ⓧ", "ⓨ", "ⓩ", "⓪", "①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑨"],
        black: ["🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜", "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩", "🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜", "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅦", "🅧", "🅨", "🅩", "⓿", "❶", "❷", "❸", "❹", "❺", "❻", "❼", "❽", "❾"]
    },
    square: {
        regular: ["🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼", "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉", "🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼", "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅆", "🅇", "🅈", "🅉"],
        black: ["🅰", "🅱", "🅲", "🅳", "🅴", "🅵", "🅶", "🅷", "🅸", "🅹", "🅺", "🅻", "🅼", "🅽", "🅾", "🅿", "🆀", "🆁", "🆂", "🆃", "🆄", "🆅", "🆆", "🆇", "🆈", "🆉", "🅰", "🅱", "🅲", "🅳", "🅴", "🅵", "🅶", "🅷", "🅸", "🅹", "🅺", "🅻", "🅼", "🅽", "🅾", "🅿", "🆀", "🆁", "🆂", "🆃", "🆄", "🆅", "🆆", "🆇", "🆈", "🆉", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
    },
    currency: {
        regular: ["₳", "฿", "₵", "Đ", "Ɇ", "₣", "₲", "Ⱨ", "ł", "J", "₭", "Ⱡ", "₥", "₦", "Ø", "₱", "Q", "Ɽ", "₴", "₮", "Ʉ", "V", "₩", "Ӿ", "Ɏ", "Ⱬ", "₳", "฿", "₵", "Đ", "Ɇ", "₣", "₲", "Ⱨ", "ł", "J", "₭", "Ⱡ", "₥", "₦", "Ø", "₱", "Q", "Ɽ", "₴", "₮", "Ʉ", "V", "₩", "Ӿ", "Ɏ", "Ⱬ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
    },
    latin: {
        extended: ["ą", "ҍ", "ç", "ժ", "ҽ", "ƒ", "ց", "հ", "ì", "ʝ", "ҟ", "Ӏ", "ʍ", "ղ", "օ", "ք", "զ", "ɾ", "ʂ", "է", "մ", "ѵ", "ա", "×", "վ", "Հ", "ą", "ҍ", "ç", "ժ", "ҽ", "ƒ", "ց", "հ", "ì", "ʝ", "ҟ", "Ӏ", "ʍ", "ղ", "օ", "ք", "զ", "ɾ", "ʂ", "է", "մ", "ѵ", "ա", "×", "վ", "Հ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        cross: ["α", "Ⴆ", "ƈ", "ԃ", "ҽ", "ϝ", "ɠ", "ԋ", "ι", "ʝ", "ƙ", "ʅ", "ɱ", "ɳ", "σ", "ρ", "ϙ", "ɾ", "ʂ", "ƚ", "υ", "ʋ", "ɯ", "x", "ყ", "ȥ", "α", "Ⴆ", "ƈ", "ԃ", "ҽ", "ϝ", "ɠ", "ԋ", "ι", "ʝ", "ƙ", "ʅ", "ɱ", "ɳ", "σ", "ρ", "ϙ", "ɾ", "ʂ", "ƚ", "υ", "ʋ", "ɯ", "x", "ყ", "ȥ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        dot: ["ä", "ḅ", "ċ", "ḋ", "ë", "ḟ", "ġ", "ḧ", "ï", "j", "ḳ", "ḷ", "ṁ", "ṅ", "ö", "ṗ", "q", "ṛ", "ṡ", "ẗ", "ü", "ṿ", "ẅ", "ẍ", "ÿ", "ż", "ä", "ḅ", "ċ", "ḋ", "ë", "ḟ", "ġ", "ḧ", "ï", "j", "ḳ", "ḷ", "ṁ", "ṅ", "ö", "ṗ", "q", "ṛ", "ṡ", "ẗ", "ü", "ṿ", "ẅ", "ẍ", "ÿ", "ż", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        fireworks: ["҉A҉", "҉B҉", "҉C҉", "҉D҉", "҉E҉", "҉F҉", "҉G҉", "҉H҉", "҉I҉", "҉J҉", "҉K҉", "҉L҉", "҉M҉", "҉N҉", "҉O҉", "҉P҉", "҉Q҉", "҉R҉", "҉S҉", "҉T҉", "҉U҉", "҉V҉", "҉W҉", "҉X҉", "҉Y҉", "҉Z҉", "҉a҉", "҉b҉", "҉c҉", "҉d҉", "҉e҉", "҉f҉", "҉g҉", "҉h҉", "҉i҉", "҉j҉", "҉k҉", "҉l҉", "҉m҉", "҉n҉", "҉o҉", "҉p҉", "҉q҉", "҉r҉", "҉s҉", "҉t҉", "҉u҉", "҉v҉", "҉w҉", "҉x҉", "҉y҉", "҉z҉", "҉0҉", "҉1҉", "҉2҉", "҉3҉", "҉4҉", "҉5҉", "҉6҉", "҉7҉", "҉8҉", "҉9҉"],
        line: ["[̲̅A̲̅", "̲̅B̲̅", "̲̅C̲̅", "̲̅D̲̅", "̲̅E̲̅", "̲̅F̲̅", "̲̅G̲̅", "̲̅H̲̅", "̲̅I̲̅", "̲̅J̲̅", "̲̅K̲̅", "̲̅L̲̅", "̲̅M̲̅", "̲̅N̲̅", "̲̅O̲̅", "̲̅P̲̅", "̲̅Q̲̅", "̲̅R̲̅", "̲̅S̲̅", "̲̅T̲̅", "̲̅U̲̅", "̲̅V̲̅", "̲̅W̲̅", "̲̅X̲̅", "̲̅Y̲̅", "̲̅Z̲̅", "̲̅a̲̅", "̲̅b̲̅", "̲̅c̲̅", "̲̅d̲̅", "̲̅e̲̅", "̲̅f̲̅", "̲̅g̲̅", "̲̅h̲̅", "̲̅i̲̅", "̲̅j̲̅", "̲̅k̲̅", "̲̅l̲̅", "̲̅m̲̅", "̲̅n̲̅", "̲̅o̲̅", "̲̅p̲̅", "̲̅q̲̅", "̲̅r̲̅", "̲̅s̲̅", "̲̅t̲̅", "̲̅u̲̅", "̲̅v̲̅", "̲̅w̲̅", "̲̅x̲̅", "̲̅y̲̅", "̲̅z̲̅", "̲̅0̲̅", "̲̅1̲̅", "̲̅2̲̅", "̲̅3̲̅", "̲̅4̲̅", "̲̅5̲̅", "̲̅6̲̅", "̲̅7̲̅", "̲̅8̲̅", "̲̅9̲̅]"],
        slash: ["A̸", "̸B̸", "̸C̸", "̸D̸", "̸E̸", "̸F̸", "̸G̸", "̸H̸", "̸I̸", "̸J̸", "̸K̸", "̸L̸", "̸M̸", "̸N̸", "̸O̸", "̸P̸", "̸Q̸", "̸R̸", "̸S̸", "̸T̸", "̸U̸", "̸V̸", "̸W̸", "̸X̸", "̸Y̸", "̸Z̸", "̸a̸", "̸b̸", "̸c̸", "̸d̸", "̸e̸", "̸f̸", "̸g̸", "̸h̸", "̸i̸", "̸j̸", "̸k̸", "̸l̸", "̸m̸", "̸n̸", "̸o̸", "̸p̸", "̸q̸", "̸r̸", "̸s̸", "̸t̸", "̸u̸", "̸v̸", "̸w̸", "̸x̸", "̸y̸", "̸z̸", "̸0̸", "̸1̸", "̸2̸", "̸3̸", "̸4̸", "̸5̸", "̸6̸", "̸7̸", "̸8̸", "̸9̸"],
        winding: ["͜A͜͡", "͜͡B͜͡", "͜͡C͜͡", "͜͡D͜͡", "͜͡E͜͡", "͜͡F͜͡", "͜͡G͜͡", "͜͡H͜͡", "͜͡I͜͡", "͜͡J͜͡", "͜͡K͜͡", "͜͡L͜͡", "͜͡M͜͡", "͜͡N͜͡", "͜͡O͜͡", "͜͡P͜͡", "͜͡Q͜͡", "͜͡R͜͡", "͜͡S͜͡", "͜͡T͜͡", "͜͡U͜͡", "͜͡V͜͡", "͜͡W͜͡", "͜͡X͜͡", "͜͡Y͜͡", "͜͡Z͜͡", "͜͡a͜͡", "͜͡b͜͡", "͜͡c͜͡", "͜͡d͜͡", "͜͡e͜͡", "͜͡f͜͡", "͜͡g͜͡", "͜͡h͜͡", "͜͡i͜͡", "͜͡j͜͡", "͜͡k͜͡", "͜͡l͜͡", "͜͡m͜͡", "͜͡n͜͡", "͜͡o͜͡", "͜͡p͜͡", "͜͡q͜͡", "͜͡r͜͡", "͜͡s͜͡", "͜͡t͜͡", "͜͡u͜͡", "͜͡v͜͡", "͜͡w͜͡", "͜͡x͜͡", "͜͡y͜͡", "͜͡z͜͡", "͜͡0͜͡", "͜͡1͜͡", "͜͡2͜͡", "͜͡3͜͡", "͜͡4͜͡", "͜͡5͜͡", "͜͡6͜͡", "͜͡7͜͡", "͜͡8͜͡", "͜͡9͡"],
        arrow: ["A͎", "͎B͎", "͎C͎", "͎D͎", "͎E͎", "͎F͎", "͎G͎", "͎H͎", "͎I͎", "͎J͎", "͎K͎", "͎L͎", "͎M͎", "͎N͎", "͎O͎", "͎P͎", "͎Q͎", "͎R͎", "͎S͎", "͎T͎", "͎U͎", "͎V͎", "͎W͎", "͎X͎", "͎Y͎", "͎Z͎", "͎a͎", "͎b͎", "͎c͎", "͎d͎", "͎e͎", "͎f͎", "͎g͎", "͎h͎", "͎i͎", "͎j͎", "͎k͎", "͎l͎", "͎m͎", "͎n͎", "͎o͎", "͎p͎", "͎q͎", "͎r͎", "͎s͎", "͎t͎", "͎u͎", "͎v͎", "͎w͎", "͎x͎", "͎y͎", "͎z͎", "͎0͎", "͎1͎", "͎2͎", "͎3͎", "͎4͎", "͎5͎", "͎6͎", "͎7͎", "͎8͎", "͎9͎"]
    },
    fancy: {
        upside: ["ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ı", "ɾ", "ʞ", "l", "ɯ", "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ", "ʍ", "x", "ʎ", "z", "ɐ", "q", "ɔ", "p", "ǝ", "ɟ", "ƃ", "ɥ", "ı", "ɾ", "ʞ", "l", "ɯ", "u", "o", "d", "b", "ɹ", "s", "ʇ", "n", "ʌ", "ʍ", "x", "ʎ", "z", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
        smallcaps: ["ᴀ", "ʙ", "ᴄ", "ᴅ", "ᴇ", "ғ", "ɢ", "ʜ", "ɪ", "ᴊ", "ᴋ", "ʟ", "ᴍ", "ɴ", "ᴏ", "ᴘ", "ǫ", "ʀ", "s", "ᴛ", "ᴜ", "ᴠ", "ᴡ", "x", "ʏ", "ᴢ", "ᴀ", "ʙ", "ᴄ", "ᴅ", "ᴇ", "ғ", "ɢ", "ʜ", "ɪ", "ᴊ", "ᴋ", "ʟ", "ᴍ", "ɴ", "ᴏ", "ᴘ", "ǫ", "ʀ", "s", "ᴛ", "ᴜ", "ᴠ", "ᴡ", "x", "ʏ", "ᴢ", "𝟶", "𝟷", "𝟸", "𝟹", "𝟺", "𝟻", "𝟼", "𝟽", "𝟾", "𝟿"],
        tildestrikethrough: ["̴A̴", "̴B̴", "̴C̴", "̴D̴", "̴E̴", "̴F̴", "̴G̴", "̴H̴", "̴I̴", "̴J̴", "̴K̴", "̴L̴", "̴M̴", "̴N̴", "̴O̴", "̴P̴", "̴Q̴", "̴R̴", "̴S̴", "̴T̴", "̴U̴", "̴V̴", "̴W̴", "̴X̴", "̴Y̴", "̴Z̴", "̴a̴", "̴b̴", "̴c̴", "̴d̴", "̴e̴", "̴f̴", "̴g̴", "̴h̴", "̴i̴", "̴j̴", "̴k̴", "̴l̴", "̴m̴", "̴n̴", "̴o̴", "̴p̴", "̴q̴", "̴r̴", "̴s̴", "̴t̴", "̴u̴", "̴v̴", "̴w̴", "̴x̴", "̴y̴", "̴z̴", "̴0̴", "̴1̴", "̴2̴", "̴3̴", "̴4̴", "̴5̴", "̴6̴", "̴7̴", "̴8̴", "̴9̴"],
        happy: ["̆̈Ă̈", "̆̈B̆̈", "̆̈C̆̈", "̆̈D̆̈", "̆̈Ĕ̈", "̆̈F̆̈", "̆̈Ğ̈", "̆̈H̆̈", "̆̈Ĭ̈", "̆̈J̆̈", "̆̈K̆̈", "̆̈L̆̈", "̆̈M̆̈", "̆̈N̆̈", "̆̈Ŏ̈", "̆̈P̆̈", "̆̈Q̆̈", "̆̈R̆̈", "̆̈S̆̈", "̆̈T̆̈", "̆̈Ŭ̈", "̆̈V̆̈", "̆̈W̆̈", "̆̈X̆̈", "̆̈Y̆̈", "̆̈Z̆̈", "̆̈ă̈", "̆̈b̆̈", "̆̈c̆̈", "̆̈d̆̈", "̆̈ĕ̈", "̆̈f̆̈", "̆̈ğ̈", "̆̈h̆̈", "̆̈ĭ̈", "̆̈j̆̈", "̆̈k̆̈", "̆̈l̆̈", "̆̈m̆̈", "̆̈n̆̈", "̆̈ŏ̈", "̆̈p̆̈", "̆̈q̆̈", "̆̈r̆̈", "̆̈s̆̈", "̆̈t̆̈", "̆̈ŭ̈", "̆̈v̆̈", "̆̈w̆̈", "̆̈x̆̈", "̆̈y̆̈", "̆̈z̆̈", "̆̈0̆̈", "̆̈1̆̈", "̆̈2̆̈", "̆̈3̆̈", "̆̈4̆̈", "̆̈5̆̈", "̆̈6̆̈", "̆̈7̆̈", "̆̈8̆̈", "̆̈9̆̈"],
        sad: ["̑̈Ȃ̈", "̑̈B̑̈", "̑̈C̑̈", "̑̈D̑̈", "̑̈Ȇ̈", "̑̈F̑̈", "̑̈G̑̈", "̑̈H̑̈", "̑̈Ȋ̈", "̑̈J̑̈", "̑̈K̑̈", "̑̈L̑̈", "̑̈M̑̈", "̑̈N̑̈", "̑̈Ȏ̈", "̑̈P̑̈", "̑̈Q̑̈", "̑̈Ȓ̈", "̑̈S̑̈", "̑̈T̑̈", "̑̈Ȗ̈", "̑̈V̑̈", "̑̈W̑̈", "̑̈X̑̈", "̑̈Y̑̈", "̑̈Z̑̈", "̑̈ȃ̈", "̑̈b̑̈", "̑̈c̑̈", "̑̈d̑̈", "̑̈ȇ̈", "̑̈f̑̈", "̑̈g̑̈", "̑̈h̑̈", "̑̈ȋ̈", "̑̈j̑̈", "̑̈k̑̈", "̑̈l̑̈", "̑̈m̑̈", "̑̈n̑̈", "̑̈ȏ̈", "̑̈p̑̈", "̑̈q̑̈", "̑̈ȓ̈", "̑̈s̑̈", "̑̈t̑̈", "̑̈ȗ̈", "̑̈v̑̈", "̑̈w̑̈", "̑̈x̑̈", "̑̈y̑̈", "̑̈z̑̈", "̑̈0̑̈", "̑̈1̑̈", "̑̈2̑̈", "̑̈3̑̈", "̑̈4̑̈", "̑̈5̑̈", "̑̈6̑̈", "̑̈7̑̈", "̑̈8̑̈", "̑̈9̑̈"],
        xabove: ["͓̽A͓̽", "͓̽B͓̽", "͓̽C͓̽", "͓̽D͓̽", "͓̽E͓̽", "͓̽F͓̽", "͓̽G͓̽", "͓̽H͓̽", "͓̽I͓̽", "͓̽J͓̽", "͓̽K͓̽", "͓̽L͓̽", "͓̽M͓̽", "͓̽N͓̽", "͓̽O͓̽", "͓̽P͓̽", "͓̽Q͓̽", "͓̽R͓̽", "͓̽S͓̽", "͓̽T͓̽", "͓̽U͓̽", "͓̽V͓̽", "͓̽W͓̽", "͓̽X͓̽", "͓̽Y͓̽", "͓̽Z͓̽", "͓̽a͓̽", "͓̽b͓̽", "͓̽c͓̽", "͓̽d͓̽", "͓̽e͓̽", "͓̽f͓̽", "͓̽g͓̽", "͓̽h͓̽", "͓̽i͓̽", "͓̽j͓̽", "͓̽k͓̽", "͓̽l͓̽", "͓̽m͓̽", "͓̽n͓̽", "͓̽o͓̽", "͓̽p͓̽", "͓̽q͓̽", "͓̽r͓̽", "͓̽s͓̽", "͓̽t͓̽", "͓̽u͓̽", "͓̽v͓̽", "͓̽w͓̽", "͓̽x͓̽", "͓̽y͓̽", "͓̽z͓̽", "͓̽0͓̽", "͓̽1͓̽", "͓̽2͓̽", "͓̽3͓̽", "͓̽4͓̽", "͓̽5͓̽", "͓̽6͓̽", "͓̽7͓̽", "͓̽8͓̽", "͓̽9͓̽"]
    }
};

const ALPHABET = 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789';

function convertToFlowerStyle(text, fontFamily, style) {
    let result = '';
    for (let char of text) {
        let index = ALPHABET.indexOf(char);
        if (index !== -1) {
            result += FONT_DATA[fontFamily][style][index];
        } else {
            result += char; // 如果字符不在字母表中，返回原字符
        }
    }
    return result;
}

let GetK = false, AMK = []

function ObjKA(i) {
    GetK = true
    AMK = Object.entries(i)
}

function operator(pro) {
    const Allmap = {};
    const outList = getList(outputName);
    let inputList,
        retainKey = "";
    if (inname !== "") {
        inputList = [getList(inname)];
    } else {
        inputList = [ZH, FG, QC, EN];
    }

    inputList.forEach((arr) => {
        arr.forEach((value, valueIndex) => {
            Allmap[value] = outList[valueIndex];
        });
    });

    if (clear || nx || blnx || key) {
        pro = pro.filter((res) => {
            const resname = res.name;
            const shouldKeep =
                !(clear && nameclear.test(resname)) &&
                !(nx && namenx.test(resname)) &&
                !(blnx && !nameblnx.test(resname)) &&
                !(key && !(keya.test(resname) && /2|4|6|7/i.test(resname)));
            return shouldKeep;
        });
    }

    const BLKEYS = BLKEY ? BLKEY.split("+") : "";
    pro.forEach((e) => {
        let FNAME = inArg.name == undefined ? (flowerName ? e._subName : "") : decodeURI(inArg.name)
        FNAME = flowerName ? convertToFlowerStyle(FNAME, font, style) : FNAME
        let bktf = false, ens = e.name
        // 预处理 防止预判或遗漏
        Object.keys(rurekey).forEach((ikey) => {
            if (rurekey[ikey].test(e.name)) {
                e.name = e.name.replace(rurekey[ikey], ikey);
                if (BLKEY) {
                    bktf = true
                    let BLKEY_REPLACE = "",
                        re = false;
                    BLKEYS.forEach((i) => {
                        if (i.includes(">") && ens.includes(i.split(">")[0])) {
                            if (rurekey[ikey].test(i.split(">")[0])) {
                                e.name += " " + i.split(">")[0]
                            }
                            if (i.split(">")[1]) {
                                BLKEY_REPLACE = i.split(">")[1];
                                re = true;
                            }
                        } else {
                            if (ens.includes(i)) {
                                e.name += " " + i
                            }
                        }
                        retainKey = re
                            ? BLKEY_REPLACE
                            : BLKEYS.filter((items) => e.name.includes(items));
                    });
                }
            }
        });
        if (blockquic == "on") {
            e["block-quic"] = "on";
        } else if (blockquic == "off") {
            e["block-quic"] = "off";
        } else {
            delete e["block-quic"];
        }

        // 自定义
        if (!bktf && BLKEY) {
            let BLKEY_REPLACE = "",
                re = false;
            BLKEYS.forEach((i) => {
                if (i.includes(">") && e.name.includes(i.split(">")[0])) {
                    if (i.split(">")[1]) {
                        BLKEY_REPLACE = i.split(">")[1];
                        re = true;
                    }
                }
            });
            retainKey = re
                ? BLKEY_REPLACE
                : BLKEYS.filter((items) => e.name.includes(items));
        }

        let ikey = "",
            ikeys = "";
        // 保留固定格式 倍率
        if (blgd) {
            regexArray.forEach((regex, index) => {
                if (regex.test(e.name)) {
                    ikeys = valueArray[index];
                }
            });
        }

        // 正则 匹配倍率
        if (bl) {
            const match = e.name.match(
                /((倍率|X|x|×)\D?((\d{1,3}\.)?\d+)\D?)|((\d{1,3}\.)?\d+)(倍|X|x|×)/
            );
            if (match) {
                const rev = match[0].match(/(\d[\d.]*)/)[0];
                if (rev !== "1") {
                    const newValue = rev + "×";
                    ikey = newValue;
                }
            }
        }

        !GetK && ObjKA(Allmap)
        // 匹配 Allkey 地区
        const findKey = AMK.find(([key]) =>
            e.name.includes(key)
        )

        let firstName = "",
            nNames = "";

        if (nf) {
            firstName = FNAME;
        } else {
            nNames = FNAME;
        }
        if (findKey?.[1]) {
            const findKeyValue = findKey[1];
            let keyover = [],
                usflag = "";
            if (addflag) {
                const index = outList.indexOf(findKeyValue);
                if (index !== -1) {
                    usflag = FG[index];
                    usflag = usflag === "🇹🇼" ? "🇨🇳" : usflag;
                }
            }
            keyover = keyover
                .concat(firstName, usflag, nNames, findKeyValue, retainKey, ikey, ikeys)
                .filter((k) => k !== "");
            e.name = keyover.join(FGF);
        } else {
            if (nm) {
                e.name = FNAME + FGF + e.name;
            } else {
                e.name = null;
            }
        }
    });
    pro = pro.filter((e) => e.name !== null);
    jxh(pro);
    numone && oneP(pro);
    blpx && (pro = fampx(pro));
    key && (pro = pro.filter((e) => !keyb.test(e.name)));
    return pro;
}

// prettier-ignore
function getList(arg) {
    switch (arg) {
        case 'us':
            return EN;
        case 'gq':
            return FG;
        case 'quan':
            return QC;
        default:
            return ZH;
    }
}

// prettier-ignore
function jxh(e) {
    const n = e.reduce((e, n) => {
        const t = e.find((e) => e.name === n.name);
        if (t) {
            t.count++;
            t.items.push({...n, name: `${n.name}${XHFGF}${t.count.toString().padStart(2, "0")}`,});
        } else {
            e.push({name: n.name, count: 1, items: [{...n, name: `${n.name}${XHFGF}01`}],});
        }
        return e;
    }, []);
    const t = (typeof Array.prototype.flatMap === 'function' ? n.flatMap((e) => e.items) : n.reduce((acc, e) => acc.concat(e.items), []));
    e.splice(0, e.length, ...t);
    return e;
}

// prettier-ignore
function oneP(e) {
    const t = e.reduce((e, t) => {
        const n = t.name.replace(/[^A-Za-z0-9\u00C0-\u017F\u4E00-\u9FFF]+\d+$/, "");
        if (!e[n]) {
            e[n] = [];
        }
        e[n].push(t);
        return e;
    }, {});
    for (const e in t) {
        if (t[e].length === 1 && t[e][0].name.endsWith("01")) {/* const n = t[e][0]; n.name = e;*/
            t[e][0].name = t[e][0].name.replace(/[^.]01/, "")
        }
    }
    return e;
}

// prettier-ignore
function fampx(pro) {
    const wis = [];
    const wnout = [];
    for (const proxy of pro) {
        const fan = specialRegex.some((regex) => regex.test(proxy.name));
        if (fan) {
            wis.push(proxy);
        } else {
            wnout.push(proxy);
        }
    }
    const sps = wis.map((proxy) => specialRegex.findIndex((regex) => regex.test(proxy.name)));
    wis.sort((a, b) => sps[wis.indexOf(a)] - sps[wis.indexOf(b)] || a.name.localeCompare(b.name));
    wnout.sort((a, b) => pro.indexOf(a) - pro.indexOf(b));
    return wnout.concat(wis);
}
